<?php

return [

    /*
    |--------------------------------------------------------------------------
    | アプリケーション共通
    |--------------------------------------------------------------------------
    |
    | 以下の言語行はアプリケーション全体で利用する必要のある様々なメッセージです。
    | 
    |
    */

    /*
    |--------------------------------------------------------------------------
    | ボタン名
    |--------------------------------------------------------------------------
    */
    'logout'      => 'ログアウト',
    'cancel'      => 'キャンセル',
    'add'         => '追加',
    'save'        => '保存',
    'delete'      => '削除',
    'search'      => '検索',
    'detail'      => '詳細',
    'approval'    => '確認',
    'back'        => '戻る',
    'exit'        => '退館',
    'cancel_exit' => '退館解除',

    /*
    |--------------------------------------------------------------------------
    | ラベル名
    |--------------------------------------------------------------------------
    */
    /* 共通 */
    'entry_area'      => 'LCMセンター',

    'actions'         => 'アクション',
    'sort_no'         => '並び順',
    'criteria'        => '検索文字列',
    'year'            => '年',
    'month'           => '月',

    /* 入館予定 */
    'schedule_date'   => '入館予定日',
    'company_name'    => '会社名(代表)',
    'visitor_name'    => '入館者名(代表)',

    /* 入館、責任者確認、入退館履歴 */
    'visit_area'      => '入館エリア',
    'visit_dt'        => '入館日時',
    'visit_date'      => '入館日',
    'visit_time'      => '入館時間',
    'last_date'       => '最終退館日',
    'last_time'       => '最終退館時間',
    'reception_user'  => '受付者名',
    'approval_user'   => '確認者名',
    'approval_dt'     => '確認日時',
    'entry_count'     => '入館数',
    'exit_count'      => '退館数',
    'purpose_remarks' => '入館理由（補足）',
    'signature'       => 'サイン',
    'exit_dt'         => '退館日時',

    /* ユーザー管理 */
    'email'           => 'Email',
    'password'        => 'パスワード',
    'password_change' => 'パスワード(変更時のみ)',
    'user_name'       => 'ユーザー名',
    'user_short_name' => '略称',
    'role'            => '役割',
    'reception'       => '受付',
    'password_confirmation' => 'パスワード（確認用）',

    /* 入館理由 */
    'purpose'         => '入館理由',

    /* 入館証 */
    'admission_no'    => '入館証',

    /*
    |--------------------------------------------------------------------------
    | メッセージ
    |--------------------------------------------------------------------------
    */
    'line' => ' 行目',
    'message_operation_error'   => '正しい操作が行われていない為、処理を行わずに終了しました。',
    'message_operation_success' => '正常に操作が完了しました。',



];
