<?php

return [

    /*
    |--------------------------------------------------------------------------
    | メニュー言語行
    |--------------------------------------------------------------------------
    |
    | 以下の言語行はアプリケーションのメニューで利用する必要のある様々なメッセージです。
    | 
    |
    */
    'schedules'        => '入館予定一覧',
    'entries'          => '入館一覧',
    'approvals'        => '責任者確認',
    'histories'        => '入退館履歴',
    'user'             => 'ユーザー管理',
    'purpose'          => '入館理由管理',
    'admission'        => '入館証管理',
    'change_password'  => 'パスワード変更',
    'logout'           => 'ログアウト',

];
